# NetworkPressureNotConverge Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPCalculationFailures..::..NetworkPressureNotConverge Property
BuiltInFailures..::..MEPCalculationFailures Class See Also
---
The calculation could not be performed. Verify the pressure on the input element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NetworkPressureNotConverge { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NetworkPressureNotConverge As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NetworkPressureNotConverge {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPCalculationFailures Class
Autodesk.Revit.DB Namespace